def zig_zag_way(arr, coordinates=False):
    if not arr or not arr[0]:
        return []
    
    m = len(arr)
    n = len(arr[0])
    result = []
    
    for d in range(n + m - 1):
        way = []

        row = 0 if d < n else d - n + 1 
        col = d if d < n else n - 1
        while row < m and col >= 0:
            if coordinates:
                way.append((row, col))
            else:
                way.append(arr[row][col])
            row += 1
            col -= 1

        if d % 2 == 0:
            way.reverse()
            
        result.extend(way)
    
    return result


# Рівень 3
# Варіант 1

# Потрібно написати програму для обходу двовимірного масиву розміром NxM у форматі
# "зігзагу". Зігзаговий обхід означає, що спочатку ми рухаємось по діагоналях масиву,
# пчинаючи з лівої верхньої точки. Другим елементом буде виведено елемент, який
# знаходиться справа, потім знизу і ліворуч, далі ще крок вниз і рухаємось по
# діагоналі знову вправо. Для масиву розміром 3x3 обхід у форматі зігзагу виглядає
# так (де номер у клітинці відповідає порядку її відвідин):
# 1 2 6
# 3 5 7
# 4 8 9
# Для масиву 3 х 5 це матиме вигляд:
# 1 2 6 7 12
# 3 5 8 11 13
# 4 9 10 14 15
# Реалізуйте алгоритм, який отримає на вхід масив розміром m та n та поверне
# одномірний масив з значеннями елементів вхідного масиву при обході його у порядку,
# зазначеному вище у задачі
# Для перевірки виконання роботи реалізованого алгоритму слід використати бібліотеку
# `unittest` . Ваш тести мають перевірити роботу алгоритму при значеннях m == n == 5,
# m =2, n =4, n = 1, m = 6, n == m == 1